---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointElementSegmentLength
source: html/6e21ebaf-0a02-47b0-266d-fe870f468525.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointElementSegmentLength Property

"Segment Length"

## Syntax (C#)
```csharp
public static ForgeTypeId PointElementSegmentLength { get; }
```